hpmicro/hpm_sdk/soc/HPM6E00/HPM6E6Y/HPM6E6Y_svd.xml
          <register>
            <name>cfg3</name>
            <description>No description available</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0072FFFF</resetMask>
            <fields>
              <field>
                <name>CNT_START_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_HW_START_EN</name>
                <description>enable use trigger to start pwm output(at next reload point), by cnt_start_sel</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_BURST</name>
                <description>output pwm wave for configured burst(timer period),
0 for one burst;  1 for two burst.
set to 0xFFFF for always output pwm wave
bit's only used when setting cnt_sw_start or trigger selected by cnt_start_sel</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>cnt_glbcfg</name>
          <description>No description available</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <fields>
            <field>
              <name>CNT_SW_START</name>
              <description>set to start pwm output(at next reload point), write only, Auto clear.
User can disable pwm output before burst end by start again with cnt_burst=0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_RESET</name>
              <description>set to clear current timer. Auto clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ENABLE</name>
              <description>1 to enable the main cycle counter; 0 to stop the counter;
NOTE:  when counter stopped, the related trigger_out will be cleared to 0, the related pwm output will keep value not changed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
          <name>CAL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>cfg0</name>
            <description>No description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1F1F1F1F</resetMask>
            <fields>
              <field>
                <name>CAL_LU_PARAM</name>
                <description>up limit parameter</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_LL_PARAM</name>
                <description>low limit parameter</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_T_PARAM</name>
                <description>period parameter</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_D_PARAM</name>
                <description>dac/counter value parameter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>No description available</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x379F9F1F</resetMask>
            <fields>
              <field>
                <name>CAL_T_INDEX</name>
                <description>select one of 4 counter reload time</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_IN_INDEX</name>
                <description>0~3 to select one of the dac input value; 4~7 to select one of the current counter value</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_LU_EN</name>
                <description>set to enable up limit</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_LIM_UP</name>
                <description>up limit offset selection, select from one of the shadow_val</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_LL_EN</name>
                <description>set to enable low limit</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_LIM_LO</name>
                <description>low limit offset selection, select from one of the shadow_val</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAL_IN_OFF</name>
                <description>offset for calculation unit, select from one of the shadow_val.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>24</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23</dimIndex>
          <name>CMP[%s]</name>
          <description>no description available</description>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>cfg</name>
            <description>No description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x773FC000</resetMask>
            <fields>
              <field>
                <name>CMP_TRIG_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux</description>
                <bitOffset>28</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CMP_UPDATE_TIME</name>
                <description>define when to use the shadow register value for working register(trig_cmp)
000:  software set work_ctrl1.shadow_lock bit
001:  update immediately(at next cycle)
010:  related counter reload time
011:  use cmp_update_trigger(from trig_mux, selected by cmp_trig_sel)
100:  use the related counter rld_cmp_sel0  to select one compare point
101:  use the related counter rld_cmp_sel1, to select one compare point
11x:  reserved, no update.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CMP_IN_SEL</name>
                <description>0x00~0x1B select one of the shadow_val directly
0x20~0x2F select one of the calculation cell output
0x30~0x37 select one of capture_pos value(low 8bit are 0)
0x38+k select T/4
0x3E select 0xFFFFF000
0x3F select 0xFFFFFF00
others select 0</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CMP_CNT</name>
                <description>select one from 4 counters, only for N&gt;=16.
for N&lt;16, this field is0, every 4 compare point related to one counter(0123 for counter0, 4567 for counter1….)</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
