hpmicro/hpm_sdk/soc/HPM6E00/HPM6E6Y/HPM6E6Y_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MTG0</name>
      <description>MTG0</description>
      <groupName>MTG</groupName>
      <baseAddress>0xf0490000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x1000</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>TRA[%s]</name>
          <description>no description available</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>control</name>
            <description>tra&amp;index0_control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000003F</resetMask>
            <fields>
              <field>
                <name>CMD_FAIL_IRQ_EN</name>
                <description>No description available</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK_IRQ_EN</name>
                <description>No description available</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_FAIL_IRQ</name>
                <description>No description available</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>LOCK_IRQ</name>
                <description>No description available</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>SW_LOCK</name>
                <description>No description available</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVALID_CLEAR</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>shift</name>
            <description>tra&amp;index0_shift</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE000077F</resetMask>
            <fields>
              <field>
                <name>ACC_SHIFT_FAIL_IRQ</name>
                <description>No description available</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>VEL_SHIFT_FAIL_IRQ</name>
                <description>No description available</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>SHIFT_FAIL_EN</name>
                <description>No description available</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>JER_SHIFT</name>
                <description>No description available</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_SHIFT</name>
                <description>No description available</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VEL_SHIFT</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>link</name>
            <description>tra&amp;index0_link</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00007777</resetMask>
            <fields>
              <field>
                <name>LINK_CFG_3</name>
                <description>No description available</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINK_CFG_2</name>
                <description>No description available</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINK_CFG_1</name>
                <description>No description available</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINK_CFG_0</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x20</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CMD[%s]</name>
            <description>no description available</description>
            <addressOffset>0x20</addressOffset>
            <register>
              <name>control</name>
              <description>tra&amp;index0_cmd&amp;index1_control</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xE000001F</resetMask>
              <fields>
                <field>
                  <name>PASS_IRQ</name>
                  <description>No description available</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                </field>
                <field>
                  <name>PASS_IRQ_EN</name>
                  <description>No description available</description>
                  <bitOffset>30</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MODE</name>
                  <description>No description available</description>
                  <bitOffset>29</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OBJECT</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>5</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>rev_preset</name>
              <description>tra&amp;index0_cmd&amp;index1_rev_preset</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>REV_PRESET</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>pos_preset</name>
              <description>tra&amp;index0_cmd&amp;index1_pos_preset</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>POS_PRESET</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>vel_preset</name>
              <description>tra&amp;index0_cmd&amp;index1_vel_preset</description>
              <addressOffset>0xc</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>VEL_PRESET</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>acc_preset</name>
              <description>tra&amp;index0_cmd&amp;index1_acc_preset</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ACC_PRESET</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>jer_preset</name>
              <description>tra&amp;index0_cmd&amp;index1_jer_preset</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>JER_PRESET</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>timestamp</name>
              <description>tra&amp;index0_cmd&amp;index1_timestamp</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TIMESTAMP</name>
                  <description>No description available</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>lock_rev</name>
            <description>tra&amp;index0_lock_rev</description>
            <addressOffset>0xa0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCK_REV</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>lock_pos</name>
            <description>tra&amp;index0_lock_pos</description>
            <addressOffset>0xa4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCK_POS</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>lock_vel</name>
            <description>tra&amp;index0_lock_vel</description>
            <addressOffset>0xa8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCK_VEL</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>lock_acc</name>
            <description>tra&amp;index0_lock_acc</description>
            <addressOffset>0xac</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCK_ACC</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>lock_time</name>
            <description>tra&amp;index0_lock_time</description>
            <addressOffset>0xb0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCK_TIME</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>step_limit_ctrl</name>
            <description>tra&amp;index0_step_limit_ctrl</description>
            <addressOffset>0xc0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00001F07</resetMask>
            <fields>
              <field>
                <name>POS_ONE_WAY_FORCE_MODE</name>
                <description>No description available</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_ONE_WAY_MODE</name>
                <description>No description available</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_ONE_WAY_EN</name>
                <description>No description available</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_STEP_MODE</name>
                <description>No description available</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_STEP_EN</name>
                <description>No description available</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VEL_ONE_WAY_MODE</name>
                <description>No description available</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VEL_ONE_WAY_EN</name>
                <description>No description available</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VEL_STEP_EN</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>vel_step_max</name>
            <description>tra&amp;index0_vel_step_max</description>
            <addressOffset>0xc4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEL_STEP_MAX</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>vel_step_min</name>
            <description>tra&amp;index0_vel_step_min</description>
            <addressOffset>0xc8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEL_STEP_MIN</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>pos_step_max</name>
            <description>tra&amp;index0_pos_step_max</description>
            <addressOffset>0xcc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>POS_STEP_MAX</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>pos_step_min</name>
            <description>tra&amp;index0_pos_step_min</description>
            <addressOffset>0xd0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>POS_STEP_MIN</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>vel_limit_p</name>
            <description>tra&amp;index0_vel_limit_p</description>
            <addressOffset>0xd4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEL_LIMIT_P</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>vel_limit_n</name>
            <description>tra&amp;index0_vel_limit_n</description>
            <addressOffset>0xd8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEL_LIMIT_N</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
