hpmicro/hpm_sdk/soc/HPM6E00/HPM6E6Y/HPM6E6Y_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="MTG0">
      <name>MTG1</name>
      <description>MTG1</description>
      <groupName>MTG</groupName>
      <baseAddress>0xf0494000</baseAddress>
    </peripheral>
    <peripheral>
      <name>VSC0</name>
      <description>VSC0</description>
      <groupName>VSC</groupName>
      <baseAddress>0xf04a0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>abc_mode</name>
          <description>abc mode</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xCFFF3338</resetMask>
          <fields>
            <field>
              <name>PHASE_ABSENT_MODE</name>
              <description>whether using value_a and value_b instead of three phase</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTION_USE_LAST_LOCKED</name>
              <description>position will not blockage vsc convert. always use last locked position, it should be cfg to 1 when position_capture_mode=2'b00 and adc valure are injected by software;</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_C_WIDTH</name>
              <description>numbers of value_c for each convert</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_B_WIDTH</name>
              <description>numbers of value_b for each convert</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_A_WIDTH</name>
              <description>numbers of value_a for each convert</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_C_LOC</name>
              <description>the adc index of value_c:
2'b:00: resevered;
2'b:01: from adc0;
2'b:10: from adc1;
2'b:11: from adc2;</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_B_LOC</name>
              <description>the adc index of value_b:
2'b:00: resevered;
2'b:01: from adc0;
2'b:10: from adc1;
2'b:11: from adc2;</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_A_LOC</name>
              <description>the adc index of value_a:
2'b:00: resevered;
2'b:01: from adc0;
2'b:10: from adc1;
2'b:11: from adc2;</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_VSC</name>
              <description>enable vsc convert:
0: disable vsc convert
1: enable vsc convert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adc_chan_assign</name>
          <description>assign adc_chan for value_a/b/c</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001F1F1F</resetMask>
          <fields>
            <field>
              <name>VALUE_C_CHAN</name>
              <description>value_c's adc chan</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_B_CHAN</name>
              <description>value_b's adc chan</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_A_CHAN</name>
              <description>value_a's adc chan</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_a_data_opt</name>
          <description>value_a data operation mode</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>OPT_3</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_2</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_1</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_0</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_b_data_opt</name>
          <description>value_b data operation mode</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>OPT_3</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_2</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_1</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_0</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_c_data_opt</name>
          <description>value_c data operation mode</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>OPT_3</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_2</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_1</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPT_0</name>
              <description>0: PLUS_MUL_1
1: PLUS_MUL_2
5: PLUS_DIV_2
6: PLUS_DIV_3
7: PLUS_DIV_4
8: MINUS MUL 1
9: MINUS MUL 2
13: MINUS DIV 2
14: MINUS DIV 3
15: MINUS DIV 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_a_offset</name>
          <description>value_a offset</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_A_OFFSET</name>
              <description>value_a offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_b_offset</name>
          <description>value_b_offset</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_B_OFFSET</name>
              <description>value_b_offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_c_offset</name>
          <description>value_c offset</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_C_OFFSET</name>
              <description>value_c offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_status</name>
          <description>irq status</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_STATUS</name>
              <description>irq status bit:
bit0: vsc convert done irq.
bit1: in adc three-phase mode, if ABS(value_a+value_b+value_c) &gt; adc_phase_tolerate, will trigger irq.
bit2: value_c overflow during capture process.
bit3: value_b_overflow during capture process.
bit4: value_a_overflow during capture process.
bit5: adc2 chan not capture enough adc value.
bit6: adc1 chan not capture enough adc value.
bit7: adc0 chan not capture enough adc value.
bit8: position not got valid before pos_wait_cycle timeout.
bit9: adc2 wait cycle timeout.
bit10: adc1 wait cycle timeout.
bit11: adc0 wait cycle timeout.
bit12: trigger_in break vsc convert even if adc or position is ready.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_a_sw</name>
          <description>value_a software inject value</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_A_SW</name>
              <description>value_a_sw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_b_sw</name>
          <description>value_b software inject value</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_B_SW</name>
              <description>value_b_sw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_c_sw</name>
          <description>value_c software inject value</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE_C_SW</name>
              <description>value_c_sw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>value_sw_ready</name>
          <description>software inject value_a/value_b/value_c ready</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>VALUE_SW_READY</name>
              <description>software inject value_a/value_b/value_c ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>trigger_sw</name>
          <description>software trigger event</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>TRIGGER_SW</name>
              <description>software trigger to start waiting adc capture value, same as hardwire trigger_in</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>timelock</name>
          <description>timestamp mode and postion capture ctrl</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000303F</resetMask>
          <fields>
            <field>
              <name>POSITION_CAPTURE_MODE</name>
              <description>postion capture mode:
00: position use last valid data when adc value capture finish
01: position use frist valid data after adc value capture
10: position use last valid data before adc value capture
other: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_TIMESTAMP_SEL</name>
              <description>adc timestamp select：
0：reserved;
1: from value_a;
2: from value_b;
3: from value_c;</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE_COUNTER_SEL</name>
              <description>adc timestamp use which number index of adc_timestamp_sel used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>position_sw</name>
          <description>position software inject value</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POSITION_SW</name>
              <description>position_sw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adc_wait_cycle</name>
          <description>adc wait cycle after trigger adc capture event</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_WAIT_CYCLE</name>
              <description>adc wait cycle after trigger adc capture event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pos_wait_cycle</name>
          <description>pos wait cycle after trigger adc capture event</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POS_WAIT_CYCLE</name>
              <description>position wait cycle after trigger adc capture event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_enable</name>
          <description>irq bit enable</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_ENABLE</name>
              <description>irq enable bit:
bit0: vsc convert done irq.
bit1: in adc three-phase mode, if ABS(value_a+value_b+value_c) &gt; adc_phase_tolerate, will trigger irq.
bit2: value_c overflow during capture process.
bit3: value_b_overflow during capture process.
bit4: value_a_overflow during capture process.
bit5: adc2 chan not capture enough adc value.
bit6: adc1 chan not capture enough adc value.
bit7: adc0 chan not capture enough adc value.
bit8: position not got valid before pos_wait_cycle timeout.
bit9: adc2 wait cycle timeout.
bit10: adc1 wait cycle timeout.
bit11: adc0 wait cycle timeout.
bit12: trigger_in break vsc convert even if adc or position is ready.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adc_phase_tolerate</name>
          <description>adc phase tolerate</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_PHASE_TOLERATE</name>
              <description>in adc three-phase mode, if ABS(value_a+value_b+value_c) &gt; adc_phase_tolerate, will trigger irq.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pos_pole</name>
          <description>position pole num</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>POS_POLE</name>
              <description>pole number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>id_posedge</name>
          <description>posedge order Id value</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_POSEDGE</name>
              <description>posedge order Id value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iq_posedge</name>
          <description>posedge order Iq value</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IQ_POSEDGE</name>
              <description>posedge order Iq value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
